УТ.УчетЗадач/src/InformationRegisters/cbr_ПросроченныеДействияПоЗадачам/cbr_ПросроченныеДействияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ПросроченныеДействияПоЗадачам</name>
  <comment>Просроченные действия по задачам</comment>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.cbr_КонтрольНадЭтапамиЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Catalogs/cbr_КонтрольНадЭтапамиЗадач/cbr_КонтрольНадЭтапамиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_КонтрольНадЭтапамиЗадач</name>
  <comment>Контроль над этапами задач</comment>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.УчетЗадач/src/CommonModules/cbr_ОбработкаПроверкиВыполненияЭтаповКонтроля/Module.bsl
#Область  ПрограммныйИнтерфейс
Процедура cbr_ПроверкаВыполненияЭтаповКонтроля() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_КонтрольНадЭтапамиЗадач.Запрос КАК Запрос,
		|	cbr_КонтрольНадЭтапамиЗадач.Ссылка КАК Ссылка,
		|	cbr_КонтрольНадЭтапамиЗадачПараметры.Параметр,
		|	cbr_КонтрольНадЭтапамиЗадачПараметры.Значение
		|ИЗ
		|	Справочник.cbr_КонтрольНадЭтапамиЗадач КАК cbr_КонтрольНадЭтапамиЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_КонтрольНадЭтапамиЗадач.Параметры КАК cbr_КонтрольНадЭтапамиЗадачПараметры
		|		ПО cbr_КонтрольНадЭтапамиЗадач.Ссылка = cbr_КонтрольНадЭтапамиЗадачПараметры.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Запрос)
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОчиститьРегистрСведенийКонтроля();
	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОчиститьРегистрСведенийКонтроля()
	Набор = РегистрыСведений.cbr_ПросроченныеДействияПоЗадачам.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(СправочникКонтроля)
	Запрос = Новый Запрос;
	Запрос.Текст = СправочникКонтроля.Запрос;
	ВыборкаПараметровКонтроля = СправочникКонтроля.Выбрать();
	Пока ВыборкаПараметровКонтроля.Следующий() Цикл
		Запрос.УстановитьПараметр(ВыборкаПараметровКонтроля.Параметр, ВыборкаПараметровКонтроля.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.cbr_ПросроченныеДействияПоЗадачам.СоздатьМенеджерЗаписи();
		Запись.Задача = Выборка.Ссылка;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Этап = СправочникКонтроля.Ссылка;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
